# Tables

In [1]:
%load_ext sql
%sql sqlite:///../../_databases/dummy.db

On ne traitera que d'un certain type de bases de données appelées bases de données **relationnelles**. Les données y sont stockées sous formes de **tables** (ou **relations**) pouvant avoir des liens entre elles.

Dans ce qui suit, on dispose d'une base de données de films. Voici par exemple la table `films` de cette base de données.

In [2]:
%%sql
SELECT * FROM films

 * sqlite:///../../_databases/dummy.db
Done.

[(1, 'Beau travail', 1999, 92, 1),
 (2, "L'intrus", 2004, 130, 1),
 (3, 'Trouble every day', 2001, 105, 1),
 (4, 'La maman et la putain', 1973, 217, 2),
 (5, 'Mes petites amoureuses', 1974, 123, 2),
 (6, 'Les idiots', 1998, 117, 3),
 (7, 'Element of crime', 1984, 104, 3),
 (8, 'Un temps pour vivre, un temps pour mourir', 1985, 138, 4),
 (9, 'Millenium mambo', 2001, 119, 4),
 (10, 'Goodbye south, goodbye', 1997, 124, 4),
 (11, 'Contes cruels de la jeunesse', 1960, 96, 5),
 (12, "Le jour de l'éclipse", 1992, 139, 6),
 (13, 'Père, fils', 2003, 97, 6),
 (14, 'Blue Velvet', 1986, 120, 7),
 (15, 'Sailor et Lula', 1990, 124, 7),
 (16, 'Twin Peaks : Fire Walk with Me', 1992, 135, 7),
 (17, 'Lost Highway', 1997, 135, 7),
 (18, 'Mulholland Drive', 2001, 146, 7),
 (19, "Voyage au bout de l'enfer", 1978, 182, 8)]

Cette table comporte cinq **colonnes** (ou **attributs**) : `id`, `titre`, `annee`, `duree` et `realisateur_id`. Chaque **ligne** est aussi appelé un **enregistrement**. On a volontairement limité l'affichage aux cinq premiers enregistrements.

```{note}
La première colonne `id` est un **identifiant** permettant d'identifier chaque ligne de manière unique. La dernière colonne est un également un identifiant faisant référence à une autre table.
<!-- TODO Mettre un lien vers la section concernée. -->
```

Voilà également la table `realisateurs` de cette base de données.

In [3]:
%%sql
SELECT * FROM realisateurs

 * sqlite:///../../_databases/dummy.db
Done.

[(1, 'Claire Denis', 'France'),
 (2, 'Jean Eustache', 'France'),
 (3, 'Lars von Trier', 'Danemark'),
 (4, 'Hou Hsiao-Hsien', 'Taïwan'),
 (5, 'Nagisa Oshima', 'Japon'),
 (6, 'Alexandre Sokourov', 'Russie'),
 (7, 'David Lynch', 'Etats-Unis'),
 (8, 'Michael Cimino', 'Etats-Unis')]

On appelle **domaine** d'un attribut l'ensemble des valeurs prises par cet attribut.

<!-- TODO Trouver un exemple -->

Chaque attribut d'une table possède un **type**. Par exemple, la colonne `titre` de la table `films` est du type *chaîne de caractères* tandis que la colonne `annee` de la table `films` est du type *entier*.

On condense les informations sur les tables à l'aide d'un **schéma de tables** faisant apparaître chaque table avec ses attributs et leurs types.

```{mermaid}
erDiagram
  films {
    int     id
    string  titre
    int     annee
    int     duree
    int     realisateur_id
  }

  realisateurs {
    int     id
    string  nom
    string  pays
  }
```